tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/flc_regs.h
/*******************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2016-03-11 11:46:37 -0600 (Fri, 11 Mar 2016) $
 * $Revision: 21839 $
 *
 ******************************************************************************/

#ifndef _MXC_FLC_REGS_H_
#define _MXC_FLC_REGS_H_

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>

/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif


#define MXC_V_FLC_ERASE_CODE_PAGE_ERASE   ((uint8_t)0x55)
#define MXC_V_FLC_ERASE_CODE_MASS_ERASE   ((uint8_t)0xAA)
#define MXC_V_FLC_FLSH_UNLOCK_KEY         ((uint8_t)0x2)

/*
   Typedefed structure(s) for module registers (per instance or section) with direct 32-bit
   access to each register in module.
*/

/*                                                          Offset          Register Description
                                                            =============   ============================================================================ */
typedef struct {
    __IO uint32_t faddr;                                /*  0x0000          Flash Operation Address                                                      */
    __IO uint32_t fckdiv;                               /*  0x0004          Flash Clock Pulse Divisor                                                    */
    __IO uint32_t ctrl;                                 /*  0x0008          Flash Control Register                                                       */
    __R  uint32_t rsv00C[6];                            /*  0x000C-0x0020                                                                                */
    __IO uint32_t intr;                                 /*  0x0024          Flash Controller Interrupt Flags and Enable/Disable 0                        */
    __R  uint32_t rsv028[2];                            /*  0x0028-0x002C                                                                                */
    __IO uint32_t fdata;                                /*  0x0030          Flash Operation Data Register                                                */
    __R  uint32_t rsv034[7];                            /*  0x0034-0x004C                                                                                */
    __IO uint32_t perform;                              /*  0x0050          Flash Performance Settings                                                   */
    __IO uint32_t tacc;                                 /*  0x0054          Flash Read Cycle Config                                                      */
    __IO uint32_t tprog;                                /*  0x0058          Flash Write Cycle Config                                                     */
    __R  uint32_t rsv05C[9];                            /*  0x005C-0x007C                                                                                */
    __IO uint32_t status;                               /*  0x0080          Security Status Flags                                                        */
    __R  uint32_t rsv084;                               /*  0x0084                                                                                       */
    __IO uint32_t security;                             /*  0x0088          Flash Controller Security Settings                                           */
    __R  uint32_t rsv08C[4];                            /*  0x008C-0x0098                                                                                */
    __IO uint32_t bypass;                               /*  0x009C          Status Flags for DSB Operations                                              */
    __R  uint32_t rsv0A0[24];                           /*  0x00A0-0x00FC                                                                                */
    __IO uint32_t user_option;                          /*  0x0100          Used to set DSB Access code and Auto-Lock in info block                      */
    __R  uint32_t rsv104[15];                           /*  0x0104-0x013C                                                                                */
    __IO uint32_t ctrl2;                                /*  0x0140          Flash Control Register 2                                                     */
    __IO uint32_t intfl1;                               /*  0x0144          Interrupt Flags Register 1                                                   */
    __IO uint32_t inten1;                               /*  0x0148          Interrupt Enable/Disable Register 1                                          */
    __R  uint32_t rsv14C[9];                            /*  0x014C-0x016C                                                                                */
    __IO uint32_t bl_ctrl;                              /*  0x0170          Bootloader Control Register                                                  */
    __IO uint32_t twk;                                  /*  0x0174          PDM33 Register                                                               */
    __R  uint32_t rsv178;                               /*  0x0178                                                                                       */
    __IO uint32_t slm;                                  /*  0x017C          Sleep Mode Register                                                          */
    __R  uint32_t rsv180[32];                           /*  0x0180-0x01FC                                                                                */
    __IO uint32_t disable_xr0;                          /*  0x0200          Disable Flash Page Exec/Read Register 0                                      */
    __IO uint32_t disable_xr1;                          /*  0x0204          Disable Flash Page Exec/Read Register 1                                      */
    __IO uint32_t disable_xr2;                          /*  0x0208          Disable Flash Page Exec/Read Register 2                                      */
    __IO uint32_t disable_xr3;                          /*  0x020C          Disable Flash Page Exec/Read Register 3                                      */
    __IO uint32_t disable_xr4;                          /*  0x0210          Disable Flash Page Exec/Read Register 4                                      */
    __IO uint32_t disable_xr5;                          /*  0x0214          Disable Flash Page Exec/Read Register 5                                      */
    __IO uint32_t disable_xr6;                          /*  0x0218          Disable Flash Page Exec/Read Register 6                                      */
    __IO uint32_t disable_xr7;                          /*  0x021C          Disable Flash Page Exec/Read Register 7                                      */
    __R  uint32_t rsv220[56];                           /*  0x0220-0x02FC                                                                                */
    __IO uint32_t disable_we0;                          /*  0x0300          Disable Flash Page Write/Erase Register 0                                    */
    __IO uint32_t disable_we1;                          /*  0x0304          Disable Flash Page Write/Erase Register 1                                    */
    __IO uint32_t disable_we2;                          /*  0x0308          Disable Flash Page Write/Erase Register 2                                    */
    __IO uint32_t disable_we3;                          /*  0x030C          Disable Flash Page Write/Erase Register 3                                    */
    __IO uint32_t disable_we4;                          /*  0x0310          Disable Flash Page Write/Erase Register 4                                    */
    __IO uint32_t disable_we5;                          /*  0x0314          Disable Flash Page Write/Erase Register 5                                    */
    __IO uint32_t disable_we6;                          /*  0x0318          Disable Flash Page Write/Erase Register 6                                    */
    __IO uint32_t disable_we7;                          /*  0x031C          Disable Flash Page Write/Erase Register 7                                    */
} mxc_flc_regs_t;


